app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "moi"], ["body", "salut"], ["created_at", "2014-12-23 11:32:34.703929"], ["post_id", 1], ["updated_at", "2014-12-23 11:32:34.703929"]]
---
  def create
    #@comment = Comment.new(comment_params)
    @post  = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)